<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Move VLC media player package from testing to production</string>
        <key>Identifier</key>
        <string>com.github.metroeast.prod.vlc</string>
        <key>Input</key>
        <dict>
            <key>PACKAGE</key>
            <string>VLC</string>
            <key>PATCH</key>
            <string>VLC media player</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>package</key>
                    <string>%PACKAGE%</string>
                    <key>patch</key>
                    <string>%PATCH%</string>
                </dict>
                <key>Processor</key>
                <string>com.honestpuck.PatchBot/Production</string>
            </dict>
        </array>
    </dict>
</plist>
