<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the Final Cut Library Manager download</string>
	<key>Identifier</key>
	<string>com.github.metroeast.pkg.FinalCutLibraryManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FinalCutLibraryManager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.final-cut-library-manager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Final Cut Library Manager.app</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Final Cut Library Manager.app</string>
			</dict>
		</dict>
		<dict>
		<key>Processor</key>
		<string>PlistReader</string>
		<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pkgroot%/Applications/Final Cut Library Manager.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
					<key>CFBundleIdentifier</key>
					<string>identifier</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>pkgname</key>
					<string>%NAME%</string>
					<key>id</key>
					<string>%identifier%</string>
					<key>version</key>
					<string>%version%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Comment</key>
            <string>Finally: Copy and rename the package, applying the version string</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
