<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Move Google Chrome package from testing to production</string>
		<key>Identifier</key>
		<string>com.github.metroeast.prod.GoogleChrome</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>GoogleChrome</string>
			<key>TITLE</key>
			<string>Google Chrome</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>package</key>
					<string>%NAME%</string>
					<key>patch</key>
					<string>%TITLE%</string>
				</dict>
				<key>Processor</key>
				<string>com.honestpuck.PatchBot/Production</string>
			</dict>
		</array>
	</dict>
</plist>
