<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by editing items created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of ActiveCollab and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.metroeast.munki.intermediaunite</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>IntermediaUnite</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Intermedia Unite desktop :: With these apps you can see who is available, chat with colleagues, send text messages to colleagues and customers, place and receive calls, share screens, start video calls and share files—all from one application—in the office or on the go.</string>
			<key>developer</key>
			<string>Intermedia.net</string>
			<key>display_name</key>
			<string>Intermedia Unite</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.metroeast.download.intermediaunite</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.metroeast.download.intermediaunite</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/Recipes/org.metroeast.autopkg-recipes/IntermediaUnite.download.recipe</string>
				<key>sha256_hash</key>
				<string>10e4a2d36af279601968ed6757d58db2457f72b3927335859c2fbfb7c7a2e8cc</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
