<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest 4K Video Downloader disk image, imports the package into Jamf Pro Cloud.  Attaches the package to test policies, per schedule limits.  Moving test package to production policies, per schedule limits.</string>
    <key>Identifier</key>
    <string>com.github.metroeast.jpci.4k video downloader</string>
    <key>Input</key>
    <dict>
        <key>PACKAGE</key>
        <string>4K Video Downloader</string>
        <key>PATCH</key>
        <string>4K Video Downloader</string>
        <key>PM_TEST_WEEKDAYS</key>
        <string>01234</string>
        <key>PM_TEST_NOT_BEFORE</key>
        <string>06:00</string>
        <key>PM_TEST_NOT_AFTER</key>
        <string>18:00</string>
        <key>PM_MIN_DAYS_FROM_TEST_TO_PROD</key>
        <string>7</string>
        <key>PM_PROD_WEEKDAYS</key>
        <string>0123</string>
        <key>PM_PROD_NOT_BEFORE</key>
        <string>07:00</string>
        <key>PM_PROD_NOT_AFTER</key>
        <string>17:00</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.4K Video Downloader</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.honestpuck.PatchBot/JPCImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>package</key>
                <string>%PACKAGE%</string>
                <key>patch</key>
                <string>%PATCH%</string>
                <key>test_weekdays</key>
                <string>%PM_TEST_WEEKDAYS%</string>
                <key>test_not_before</key>
                <string>%PM_TEST_NOT_BEFORE%</string>
                <key>test_not_after</key>
                <string>%PM_TEST_NOT_AFTER%</string>
            </dict>
            <key>Processor</key>
            <string>com.honestpuck.PatchBot/PatchManager</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>package</key>
                <string>%PACKAGE%</string>
                <key>patch</key>
                <string>%PATCH%</string>
                <key>min_days_until_prod</key>
                <string>%PM_MIN_DAYS_FROM_TEST_TO_PROD%</string>
                <key>prod_weekdays</key>
                <string>%PM_PROD_WEEKDAYS%</string>
                <key>prod_not_before</key>
                <string>%PM_PROD_NOT_BEFORE%</string>
                <key>prod_not_after</key>
                <string>%PM_PROD_NOT_AFTER%</string>
            </dict>
            <key>Processor</key>
            <string>com.honestpuck.PatchBot/Production</string>
        </dict>
    </array>
</dict>
</plist>
